# Ultralytics YOLO 🚀, AGPL-3.0 license
# =====================================================================
# IMCMD-TS (IMCMD + YOLO-TS) - 混合架构
# =====================================================================
# 
# 组合来源:
#   - IMCMD论文: "Improved YOLOv8 for small object detection" (Fei Feng, 2024)
#   - YOLO-TS论文: YOLO-TS Traffic Sign Detection
#
# IMCMD组件 (保留):
#   1. 移除P5层
#   2. C2f_CA模块 (Coordinate Attention)
#   3. DynamicHeadBlock (集成在Detect_IMCMD中)
#   4. P2(160x160) + P3(80x80) 双检测头
#
# YOLO-TS组件 (新增):
#   1. HR-MSD (High-Resolution Multi-Scale Detection)
#   2. AGRFM (Anti-Grid Receptive Field Module) - 替代AMFF
#   3. Bilinear上采样 - 替代Nearest上采样
#
# 特点: 小目标检测增强 + 高分辨率特征融合 + 抗Grid效应

# Parameters
nc: 10
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

# ================================
# Backbone: IMCMD Style (移除P5)
# ================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2 (320x320)
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4 (160x160)
  - [-1, 3, C2f_CA, [128, True]]    # 2 - P2_backbone: [B, 64, 160, 160]
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8 (80x80)
  - [-1, 6, C2f_CA, [256, True]]    # 4 - P3_backbone: [B, 128, 80, 80]
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16 (40x40)
  - [-1, 6, C2f_CA, [512, True]]    # 6 - P4_backbone: [B, 256, 40, 40]
  - [-1, 1, SPPF, [512, 5]]         # 7 - SPPF: [B, 256, 40, 40]

# ================================
# Head: YOLO-TS Style Neck + IMCMD Detection
# ================================
head:
  # === FPN上采样路径 (YOLO-TS: bilinear上采样) ===
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]  # 8: SPPF→P3尺度 (40→80)
  - [[-1, 4], 1, Concat, [1]]                     # 9: cat backbone P3 → [B, 384, 80, 80]
  - [-1, 3, C2f_CA, [256]]                        # 10: P3_fused: [B, 128, 80, 80]
  
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]  # 11: P3→P2尺度 (80→160)
  - [[-1, 2], 1, Concat, [1]]                     # 12: cat backbone P2 → [B, 192, 160, 160]
  - [-1, 3, C2f_CA, [128]]                        # 13: P2_fused: [B, 64, 160, 160]
  
  # === 通道对齐为32通道 ===
  - [-1, 1, Conv, [64, 1, 1]]                     # 14: P2_aligned: [B, 32, 160, 160]
  - [10, 1, Conv, [64, 1, 1]]                     # 15: P3_aligned: [B, 32, 80, 80]
  - [6, 1, Conv, [64, 1, 1]]                      # 16: P4_aligned: [B, 32, 40, 40]
  
  # === HR-MSD + AGRFM 融合 (YOLO-TS Style) ===
  - [15, 1, nn.Upsample, [None, 2, 'bilinear']]  # 17: P3_aligned上采样 → [B, 32, 160, 160]
  - [16, 1, nn.Upsample, [None, 4, 'bilinear']]  # 18: P4_aligned上采样 → [B, 32, 160, 160]
  - [[14, 17, 18], 1, Concat, [1]]                # 19: F_fuse: [B, 96, 160, 160]
  - [-1, 1, AGRFM, [64]]                          # 20: B2: [B, 32, 160, 160]
  
  # === P2检测头 (160x160) ===
  - [[14, 20], 1, Concat, [1]]                    # 21: [B, 64, 160, 160]
  - [-1, 3, C2f_CA, [64]]                         # 22: P2_det: [B, 32, 160, 160]
  
  # === P3检测头 (80x80) ===
  - [20, 1, Conv, [64, 3, 2]]                     # 23: B2_ds: [B, 32, 80, 80]
  - [[15, 23], 1, Concat, [1]]                    # 24: [B, 64, 80, 80]
  - [-1, 3, C2f_CA, [64]]                         # 25: P3_det: [B, 32, 80, 80]
  
  # === Detect (IMCMD Style with DynamicHead) ===
  - [[22, 25], 1, Detect_IMCMD, [nc]]             # 26: Detect_IMCMD(P2@160, P3@80)

