# Ultralytics YOLO 🚀, AGPL-3.0 license
# =====================================================================
# 纯 YOLO-TS 版本 - 标准YOLOv8s + bilinear上采样 + AGRFM
# =====================================================================
# 
# 基于标准YOLOv8s结构:
#   - bilinear上采样 (替代nearest)
#   - AGRFM模块增强P3特征
# 
# 用于消融实验

# Parameters
nc: 10
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

# ================================
# Backbone: 标准 YOLOv8
# ================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0: P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1: P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3: P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5: P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7: P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9

# ================================
# Head: FPN-PAN with bilinear + AGRFM
# ================================
head:
  # FPN (bilinear上采样)
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]  # 10: P5→P4
  - [[-1, 6], 1, Concat, [1]]                     # 11
  - [-1, 3, C2f, [512]]                           # 12: P4 (256ch)
  
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]  # 13: P4→P3
  - [[-1, 4], 1, Concat, [1]]                     # 14
  - [-1, 3, C2f, [256]]                           # 15: P3 (128ch)
  
  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                    # 16: P3→P4
  - [[-1, 12], 1, Concat, [1]]                    # 17
  - [-1, 3, C2f, [512]]                           # 18: P4 (256ch)
  
  - [-1, 1, Conv, [512, 3, 2]]                    # 19: P4→P5
  - [[-1, 9], 1, Concat, [1]]                     # 20
  - [-1, 3, C2f, [1024]]                          # 21: P5 (512ch)
  
  # AGRFM增强P3特征 (简单插入)
  - [15, 1, AGRFM, [128, 128]]                    # 22: P3+AGRFM (128ch)
  
  # Detect
  - [[22, 18, 21], 1, Detect, [nc]]               # 23: P3(128), P4(256), P5(512)
