# YOLOv8s + CBAM
# 在Backbone的P3/P4/P5特征层后添加CBAM注意力
# 轻量、稳定、验证有效

# Parameters
nc: 7
scales:
  s: [0.33, 0.50, 1024]

# YOLOv8s backbone with CBAM
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4 → 实际128ch
  - [-1, 1, CBAM, [128]]  # 5 - P3后加CBAM（实际128ch）
  
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [512, True]]  # 7 → 实际256ch
  - [-1, 1, CBAM, [256]]  # 8 - P4后加CBAM（实际256ch）
  
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]]  # 10 → 实际512ch
  - [-1, 1, CBAM, [512]]  # 11 - P5后加CBAM（实际512ch）
  - [-1, 1, SPPF, [1024, 5]]  # 12

# YOLOv8s head（标准）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4(带CBAM)
  - [-1, 3, C2f, [512]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3(带CBAM)
  - [-1, 3, C2f, [256]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)

