# Ultralytics YOLO 🚀, AGPL-3.0 license
# =====================================================================
# IMCMD_YOLOv8_small - 纯IMCMD论文实现
# =====================================================================
# 基于论文: "Improved YOLOv8 algorithms for small object detection in aerial imagery" (Fei Feng et al., 2024)
#
# 完整IMCMD改进：
#   1. 移除P5层
#   2. C2f_CA模块（Coordinate Attention）
#   3. AMFF模块（Adaptive Multiscale Feature Fusion）
#   4. P2(160x160) + P3(80x80) 双检测头
#   5. DynamicHeadBlock (集成在Detect_IMCMD中)
#
# 注意: 如需YOLO-TS风格的HR-MSD+AGRFM，请使用 yolov8s_imcmd_ts_small.yaml

# Parameters
nc: 10
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

# ================================
# Backbone: 移除P5，保留P2/P3/P4
# ================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2 (320x320)
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4 (160x160)
  - [-1, 3, C2f_CA, [128, True]]    # 2 - P2_backbone
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8 (80x80)
  - [-1, 6, C2f_CA, [256, True]]    # 4 - P3_backbone
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16 (40x40)
  - [-1, 6, C2f_CA, [512, True]]    # 6 - P4_backbone
  - [-1, 1, SPPF, [512, 5]]         # 7 - SPPF

# ================================
# Head: FPN + AMFF + P2/P3检测
# ================================
head:
  # === FPN上采样路径 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 8: P4->P3尺度 (40->80)
  - [[-1, 4], 1, Concat, [1]]                   # 9: cat backbone P3
  - [-1, 3, C2f_CA, [256]]                      # 10: P3特征 (80x80, 256ch)
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11: P3->P2尺度 (80->160)
  - [[-1, 2], 1, Concat, [1]]                   # 12: cat backbone P2
  - [-1, 3, C2f_CA, [128]]                      # 13: P2特征 (160x160, 128ch)
  
  # === 通道调整为64（轻量化）===
  - [-1, 1, Conv, [64, 1, 1]]                   # 14: P2→64ch (160x160)
  - [10, 1, Conv, [64, 1, 1]]                   # 15: P3→64ch (80x80, 从layer 10)
  - [6, 1, Conv, [64, 1, 1]]                    # 16: P4→64ch (40x40, 从backbone layer 6)
  
  # === AMFF融合 (在P2尺度160x160) ===
  # 将P3和P4上采样到P2的160x160尺度
  - [15, 1, nn.Upsample, [None, 2, 'nearest']]  # 17: P3上采样 80->160
  - [16, 1, nn.Upsample, [None, 4, 'nearest']]  # 18: P4上采样 40->160
  
  # Concat P2+P3+P4 (全部在160x160尺度)
  - [[14, 17, 18], 1, Concat, [1]]              # 19: concat [64+64+64=192ch]
  
  # AMFF融合: 自动检测输入通道并split，输出32ch (width=0.5后)
  - [-1, 1, AMFF, [64]]                         # 20: AMFF (160x160, 32ch)
  
  # === P2检测头 (160x160) ===
  - [[14, 20], 1, Concat, [1]]                  # 21: P2原始+AMFF [32+32=64]
  - [-1, 3, C2f_CA, [64]]                       # 22: P2检测特征 (160x160)
  
  # === P3检测头 (80x80) ===
  # 将AMFF下采样到P3尺度
  - [20, 1, Conv, [64, 3, 2]]                   # 23: AMFF下采样 160->80
  - [[15, 23], 1, Concat, [1]]                  # 24: P3原始+AMFF [32+32=64]
  - [-1, 3, C2f_CA, [64]]                       # 25: P3检测特征 (80x80)
  
  # === Detect ===
  - [[22, 25], 1, Detect_IMCMD, [nc]]           # 26: Detect_IMCMD(P2@160, P3@80)
