# Ultralytics YOLO 🚀, AGPL-3.0 license
# IMCMD_YOLOv8_large - 高性能版本
# 基于论文: "Improved YOLOv8 algorithms for small object detection in aerial imagery" (Fei Feng et al., 2024)

# Parameters
nc: 10
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

# ================================
# Backbone: 移除P5，保留P2/P3/P4
# ================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2 (320x320)
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4 (160x160)
  - [-1, 3, C2f_CA, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8 (80x80)
  - [-1, 6, C2f_CA, [256, True]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16 (40x40)
  - [-1, 6, C2f_CA, [512, True]]    # 6
  - [-1, 1, SPPF, [512, 5]]         # 7

# ================================
# Head: FPN + AMFF + P2/P3检测头
# ================================
head:
  # === FPN上采样路径 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 8: P4->P3尺度 (40->80)
  - [[-1, 4], 1, Concat, [1]]                   # 9: cat P3
  - [-1, 3, C2f_CA, [256]]                      # 10: P3特征 (80x80)
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11: P3->P2尺度 (80->160)
  - [[-1, 2], 1, Concat, [1]]                   # 12: cat P2
  - [-1, 3, C2f_CA, [128]]                      # 13: P2特征 (160x160)
  
  # === 通道调整为128（高性能）===
  - [-1, 1, Conv, [128, 1, 1]]                  # 14: P2→128ch (160x160)
  - [10, 1, Conv, [128, 1, 1]]                  # 15: P3→128ch (80x80)
  - [6, 1, Conv, [128, 1, 1]]                   # 16: P4→128ch (40x40)
  
  # === AMFF融合 (在P2尺度160x160) ===
  - [15, 1, nn.Upsample, [None, 2, 'nearest']]  # 17: P3上采样 80->160
  - [16, 1, nn.Upsample, [None, 4, 'nearest']]  # 18: P4上采样 40->160
  
  # Concat P2+P3+P4
  - [[14, 17, 18], 1, Concat, [1]]              # 19: concat [128+128+128=384ch]
  
  # AMFF融合: 输出128ch
  - [-1, 1, AMFF, [128]]                        # 20: AMFF (160x160, 128ch)
  
  # === P2检测头 (160x160) ===
  - [[14, 20], 1, Concat, [1]]                  # 21: P2原始+AMFF [128+128=256]
  - [-1, 3, C2f_CA, [128]]                      # 22: P2检测特征 (160x160, 128ch)
  
  # === P3检测头 (80x80) ===
  - [20, 1, Conv, [128, 3, 2]]                  # 23: AMFF下采样 160->80
  - [[15, 23], 1, Concat, [1]]                  # 24: P3原始+AMFF [128+128=256]
  - [-1, 3, C2f_CA, [128]]                      # 25: P3检测特征 (80x80, 128ch)
  
  # === Detect ===
  - [[22, 25], 1, Detect_IMCMD, [nc]]           # 26: Detect_IMCMD(P2@160, P3@80) - 使用Dynamic Head
